Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [6]:
data1 = [4,8,15,16,23,42]
data1

[4, 8, 15, 16, 23, 42]

In [7]:
import pandas as pd

Pandas_Series = pd.Series(data1)
Pandas_Series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [16]:
data2 = [2,3,5,6.90,9+5j,'PWSkills',"Data_Sciene",'MAthBoi','Mukarram','Sudh']
print(f"My series which is name as 'data2' contain {len(data2)} elements")

My series which is name as 'data2' contain 10 elements

In [20]:
Pandas_Series2 = pd.Series(data2)
Pandas_Series2

0              2
1              3
2              5
3            6.9
4         (9+5j)
5       PWSkills
6    Data_Sciene
7        MAthBoi
8       Mukarram
9           Sudh
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

In [25]:
Data_Frame1 = {'Name':('Alice','Bob','Claire'),'Age':(25,30,27),'Gender':('Female','Male','Female')}
Data_Frame1

{'Name': ('Alice', 'Bob', 'Claire'),
 'Age': (25, 30, 27),
 'Gender': ('Female', 'Male', 'Female')}

In [28]:
Data_Frame1_print = pd.DataFrame(Data_Frame1)
Data_Frame1_print

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, tabular data is stored and processed using DataFrame, a two-dimensional labelled data structure. Each column in the DataFrame is a Series, so it is a collection of Pandas Series objects.

The main distinction between a Series and a DataFrame is that a Series represents a single column of data, whereas a DataFrame represents a table of data with numerous columns and rows. To put it another way, a DataFrame is an object that resembles a two-dimensional array while a Series resembles a one-dimensional array.

In [29]:
import pandas as pd

# Example of a Pandas Series
series = pd.Series([1, 2, 3, 4])
print("Series:")
print(series)

# Example of a Pandas DataFrame
data = {
    "name": ["Alice", "Bob", "Charlie", "Dave"],
    "age": [25, 30, 35, 40],
    "gender": ["F", "M", "M", "M"]
}

df = pd.DataFrame(data)
print("\nDataFrame:")
print(df)

Series:
0    1
1    2
2    3
3    4
dtype: int64

DataFrame:
      name  age gender
0    Alice   25      F
1      Bob   30      M
2  Charlie   35      M
3     Dave   40      M

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

To manipulate the data in a DataFrame, there are a wide variety of functions and methods available in Pandas. These are a few that are regularly employed:

01. read_csv():

This function is used to read data from a CSV (Comma-Separated Values) file into a Pandas DataFrame.

In [40]:
# Example:
import pandas as pd
df=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/blood-transfusion/transfusion.data')
# read data from CSV file
df

,Recency (months),Frequency (times),Monetary (c.c. blood),Time (months),whether he/she donated blood in March 2007
0,2,50,12500,98,1
1,0,13,3250,28,1
2,1,16,4000,35,1
3,2,20,5000,45,1
4,1,24,6000,77,0
...,...,...,...,...,...
743,23,2,500,38,0
744,21,2,500,52,0
745,23,3,750,62,0
746,39,1,250,39,0
747,72,1,250,72,0

02.head():

To display the first n rows of a DataFrame, use this function. It is beneficial to immediately comprehend the DataFrame's structure. But by default head() will print first 5 rows if we enter any interger into the parenthesis then it will only show that no. of rows from top
Example:

In [48]:
df.head()  # display the first 5 rows of the DataFrame

,Recency (months),Frequency (times),Monetary (c.c. blood),Time (months),whether he/she donated blood in March 2007
0,2,50,12500,98,1
1,0,13,3250,28,1
2,1,16,4000,35,1
3,2,20,5000,45,1
4,1,24,6000,77,0

In [49]:
df.head(3)  # display the first 5 rows of the DataFrame

,Recency (months),Frequency (times),Monetary (c.c. blood),Time (months),whether he/she donated blood in March 2007
0,2,50,12500,98,1
1,0,13,3250,28,1
2,1,16,4000,35,1

03. tail():

This function is used to view the last n rows of a DataFrame. It is helpful to check if the data is loaded correctly or to see if there are any data issues at the end of the DataFrame.
But by default tail() will print last 5 rows if we enter any interger into the parenthesis then it will only show that no. of rows from bottom
Example:

In [53]:

df.tail()  # display the last 5 rows of the DataFrame

,Recency (months),Frequency (times),Monetary (c.c. blood),Time (months),whether he/she donated blood in March 2007
743,23,2,500,38,0
744,21,2,500,52,0
745,23,3,750,62,0
746,39,1,250,39,0
747,72,1,250,72,0

In [55]:

df.tail(2)  # display the last 2 rows of the DataFrame

,Recency (months),Frequency (times),Monetary (c.c. blood),Time (months),whether he/she donated blood in March 2007
746,39,1,250,39,0
747,72,1,250,72,0

04. describe():

This function provides a summary of the DataFrame's statistics, including mean, standard deviation, and quartile ranges.

In [57]:

df.describe()  # display the summary statistics of the DataFrame

,Recency (months),Frequency (times),Monetary (c.c. blood),Time (months),whether he/she donated blood in March 2007
count,748.000000,748.000000,748.000000,748.000000,748.000000
mean,9.506684,5.514706,1378.676471,34.282086,0.237968
std,8.095396,5.839307,1459.826781,24.376714,0.426124
min,0.000000,1.000000,250.000000,2.000000,0.000000
25%,2.750000,2.000000,500.000000,16.000000,0.000000
50%,7.000000,4.000000,1000.000000,28.000000,0.000000
75%,14.000000,7.000000,1750.000000,50.000000,0.000000
max,74.000000,50.000000,12500.000000,98.000000,1.000000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Both Series and DataFrame are types of objects that can be changed. We can alter the individual index labels of certain Series components by altering their values. A cell's value can be modified by using the column and row labels or indexes of a DataFrame. It's important to keep in mind that some Pandas operations return a new object rather than changing the original one because Series and DataFrame can be changed. For instance, the concat() function creates a brand-new DataFrame rather than modifying the existing one. However, due to its 3D structure, Panel is less common and more difficult to visualise than the other two due to its difficulty being displayed on a screen.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [58]:
import pandas as pd

# create a Series for each column of the DataFrame
fruits = pd.Series(['apple', 'banana', 'orange'])
prices = pd.Series([1.2, 0.5, 0.8])
colors = pd.Series(['red', 'yellow', 'orange'])

# create the DataFrame using a dictionary of Series
df_using_multi_Series = pd.DataFrame({'Fruit': fruits, 'Price': prices, 'Color': colors})

# print the DataFrame
df_using_multi_Series

    Fruit  Price   Color
0   apple    1.2     red
1  banana    0.5  yellow
2  orange    0.8  orange